# core utils
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed"
brew "gzip"
brew "rcm"

# build tools
brew "automake"
brew "autoconf"
brew "libyaml"
brew "readline"
brew "libxslt"
brew "libtool"
brew "unixodbc"

# helpers
brew "mas"
brew "ripgrep"
brew "fd"
brew "grep"
brew "pwgen"
brew "openssh"
brew "tree"
brew "watch"
brew "htop"
brew "nmap"
brew "ifstat"
brew "fzf"

# development tools
brew "asdf"
cask "1password-cli"
brew "git"
brew "vim"
brew "ffmpeg"
brew "imagemagick"
brew "dmg2img"
brew "ctop"
brew "mitmproxy"
brew "wget"
brew "httpie"
brew "jq"
brew "dnsmasq"
brew "mkcert"

# vendor specific tools
brew "doctl"

# documentation tools
brew "markdown"
brew "graphviz"
brew "pandoc"

# terminal tools
brew "screen"
brew "tmux"
brew "reattach-to-user-namespace"

# Cask apps

# Fonts
tap "homebrew/cask-fonts"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-pacifico"

# Essentials
cask "1password"
cask "appdelete"
cask "bartender"
cask "daisydisk"
cask "enpass"
cask "gpg-suite"
cask "hyperdock"
cask "istat-menus"
cask "lulu"
cask "nextcloud"
cask "raycast"
cask "tunnelblick"

# Browsers
cask "firefox"
cask "google-chrome"
cask "microsoft-edge"

# Communication
cask "discord"
cask "jitsi-meet"
cask "mattermost"
cask "microsoft-teams"
cask "signal"
cask "slack"
cask "whatsapp"

# Development
cask "docker"

tap "mutagen-io/mutagen"
brew "mutagen-io/mutagen/mutagen"
brew "mutagen-io/mutagen/mutagen-compose"

brew "kubectl"
brew "kustomize"
brew "kubeseal"

cask "android-studio"
cask "drawio"
cask "figma"
cask "gas-mask"
cask "kitty"
cask "linear-linear"
cask "mjml"
cask "notion"
cask "postman"
cask "stoplight-studio"
cask "tableplus"
cask "visual-studio-code"

# Misc
cask "calibre"
cask "fliqlo"
cask "kindle"
tap "homebrew/cask-drivers"
cask "sonos"

# App Store apps
mas "1Password for Safari", id: 1569813296
mas "Color Picker", id: 641027709
mas "Dark Reader for Safari", id: 1438243180
mas "Keynote", id: 409183694
mas "Microsoft To Do", id: 1274495053
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Save to Raindrop.io", id: 1549370672
mas "Spark", id: 1176895641
mas "Tyme", id: 1461456897
mas "Vimari", id: 1480933944
mas "Xcode", id: 497799835
mas "Yoink", id: 457622435

